app/views/events/show.html.erb

SELECT `feeds`.* FROM `feeds` WHERE `feeds`.`event_id` = 1
---
<h2>Streams</h2>
<% @event.feeds.each do |feed| %>