app/controllers/events_controller.rb

	def show
    	@event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

	def edit
		@event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

	def create
		@event = Event.new(event_params)

	 	if @event.save
---
INSERT INTO `events` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Event1', 'Testbeschreibung', '2015-04-17 21:01:17.334559', '2015-04-17 21:01:17.334559')

	def update
		@event = Event.find(params[:id])

		if @event.update(event_params)
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
UPDATE `events` SET `title` = 'Evenmnnnnt1', `updated_at` = '2015-04-17 21:26:02.081627' WHERE `events`.`id` = 1

	def destroy
		@event = Event.find(params[:id])
		@event.destroy
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 2