rails/app/controllers/events_controller.rb

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
---
	def show
  	@event = Event.find(params[:id])

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
---
	def edit
		@event = Event.find(params[:id])

SELECT  `connections`.* FROM `connections` WHERE `connections`.`used` = 0  ORDER BY `connections`.`id` ASC LIMIT 1
UPDATE `connections` SET `used` = 1, `updated_at` = '2015-05-23 18:18:10.583492' WHERE `connections`.`id` = 1
INSERT INTO `events` (`title`, `description`, `user_id`, `connection_id`, `created_at`, `updated_at`) VALUES ('Test1', 'Test', 1, 1, '2015-05-23 18:18:10.603167', '2015-05-23 18:18:10.603167')
---
	def create
		@event = Event.new(event_params)
		@event.user_id = current_user.id
    @connection = Connection.where(used: false).first
 		@event.connection_id = @connection.id
    @connection.used = true

    s = TCPSocket.new 'localhost', 9999
    s.puts "start node"
		s.puts @connection.ip
		s.puts @connection.port
		s.puts "call"
		puts s.gets
		s.close

    @connection.save

    @event.url = "call"
	 	if @event.save

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
UPDATE `events` SET `title` = 'Evenmnnnnt1', `updated_at` = '2015-04-17 21:26:02.081627' WHERE `events`.`id` = 1
---
	def update
		@event = Event.find(params[:id])

		if @event.update(event_params)

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 2
---
	def destroy
		@event = Event.find(params[:event_id])
		connection = @event.connection
		@event.destroy