rails/app/controllers/feeds_controller.rb

SELECT  `events`.* FROM `events` WHERE `events`.`id` = NULL LIMIT 1
SELECT  `connections`.* FROM `connections` WHERE `connections`.`used` = 0  ORDER BY `connections`.`id` ASC LIMIT 1
UPDATE `connections` SET `used` = 1, `updated_at` = '2015-04-18 13:44:56.418398' WHERE `connections`.`id` = 1
UPDATE `feeds` SET `user_id` = 1, `updated_at` = '2015-04-18 12:54:37.940639' WHERE `feeds`.`id` = 1
INSERT INTO `feeds` (`title`, `event_id`, `user_id`, `connection_id`, `created_at`, `updated_at`) VALUES ('Feed3', 1, 1, 1, '2015-04-18 13:44:08.615551', '2015-04-18 13:44:08.615551')
INSERT INTO `streams` (`feed_id`, `created_at`, `updated_at`) VALUES (7, '2015-04-18 13:48:52.460858', '2015-04-18 13:48:52.460858')
---
	def create
    	@event = Event.find(params[:event_id])
    	@feed = @event.feeds.new(feed_params)
    	@feed.user_id = current_user.id
    	connection = Connection.where(used: false).first
    	@feed.connection_id = connection.id
    	connection.used = true
    	connection.save
    	@feed.save

    	@stream = @feed.streams.new()
    	@stream.save